package modules.OneJavaBasics;

public class Introduction {
    public static void introduction() {
        System.out.println("Java — язык программирования общего назначения, который является одним из самых "
                + "востребованных языков. Он используется для создания приложений в разных областях: в вебе, "
                + "разработке игр, мобильного ПО, и даже программ для корпораций и научных институтов.\n"
                + "\n"
                + "Подавляющее большинство крупных компаний так или иначе используют Java. Очень много серверных "
                + "приложений для корпораций написаны на этом языке. Например, речь идет о программах для финансовых "
                + "организаций, которые обеспечивают проведение транзакций, фиксацию торговых операций.\n"
                + "\n"
                + "На Java написано много веб-приложений. Популярные фреймворки, в том числе Spring, Struts, JSP, "
                + "используются для создания разных приложений в вебе: от ecommerce-проектов до крупных порталов, от "
                + "бразовательных платформ до правительственных ресурсов. Потому работу на Java можно найти практически "
                + "везде. Профессия Java-разработчик на Хекслете дает все необходимые знания и навыки для "
                + "трудоустройства, и именно с этого курса начинается погружение в сам язык.\n"
                + "\n"
                + "Курс включает в себя основы программирования на Java и объясняет важные базовые вещи: типы данных "
                + "и их представление, стандарты именования, кодирование строк, работа над ошибками, побочные эффекты "
                + "и многое другое.\n"
                + "\n"
                + "Изучение основ программирования с самого нуля требует особого способа организации учебного "
                + "материала. На первом этапе необходимо первичное привыкание к языковым конструкциям и закрепление "
                + "их на практике.\n"
                + "\n"
                + "Цели данного курса:\n"
                + "\n"
                + "Познакомиться с основными конструкциями языка\n"
                + "Научиться работать в среде Хекслета, разобраться со структурой практических заданий\n"
                + "Познакомиться с отладкой и научиться эффективно ее выполнять\n"
                + "Каждый урок курса заканчивается вопросами для самоконтроля и упражнением, а после курса вас ждет "
                + "множество дополнительных заданий, которые желательно выполнить до перехода на следующий курс. Эти "
                + "задания охватывают сразу весь материал курса и помогают наработать необходимую практику для "
                + "дальнейшего продвижения по профессии.");
    }
}
